---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderPersistentIds.Dispose
source: html/73d61523-7280-b04d-480f-9ae04a9373af.htm
---
# Autodesk.Revit.DB.BRepBuilderPersistentIds.Dispose Method

Releases all resources used by the BRepBuilderPersistentIds

## Syntax (C#)
```csharp
public void Dispose()
```